[
    {
        "id": 2,
        "server": "matrix-federation.matrix.org",
        "room_id": "!OGEhHVWSdvArJzumhm:matrix.org",
        "name": "Matrix HQ",
        "topic": "The Official Matrix HQ - chat about Matrix here! | https://matrix.org | https://spec.matrix.org | To support Matrix.org development: https://donorbox.org/keep-matrix-exciting | Code of Conduct: https://matrix.org/legal/code-of-conduct/ | This is an English speaking room",
        "num_joined_members": 68387,
        "world_readable": 1,
        "guest_can_join": 1,
        "avatar_url": "mxc://matrix.org/DRevoaEiuzbkOznknySKuMmE",
        "canonical_alias": "#matrix:matrix.org",
        "aliases": ""
    },
    {
        "id": 3,
        "server": "matrix-federation.matrix.org",
        "room_id": "!AGeUOyHpLMMrLYAkXW:matrix.org",
        "name": "Genshin Impact | 🇮🇩",
        "topic": "Tempat membahas hal seputar Genshin Impact.\n\nGroup : https://t.meGenshinImpact_ID\nChannel : https://t.meGenshinImpact_ID_Info\nDiscord : https://discord.gg/ghhwkBFcfY\nMatrix : https://matrix.to/#/#genshin-impact:matrix.org\n\nAbout :\nhttps://telegra.ph/About-Genshin-Impact-10-21",
        "num_joined_members": 38479,
        "world_readable": 0,
        "guest_can_join": 0,
        "avatar_url": "mxc://matrix.org/gXRwiJNrCnMvuZxywJjeJwGI",
        "canonical_alias": "#genshin-impact:matrix.org",
        "aliases": ""
    },
    {
        "id": 4,
        "server": "matrix-federation.matrix.org",
        "room_id": "!hKwFRvooxscFyToTfI:matrix.org",
        "name": "Filecoin Lobby",
        "topic": "This is a read-only mirror from the Filecoin Slack Community. To participate, please go to https://filecoin.io/slack",
        "num_joined_members": 27855,
        "world_readable": 0,
        "guest_can_join": 0,
        "avatar_url": "mxc://matrix.org/vKiJMJzJGezyOwZSXgzCbSAf",
        "canonical_alias": "#fil-lobby:matrix.org",
        "aliases": ""
    },
    {
        "id": 5,
        "server": "matrix.netho.tk",
        "room_id": "!wOlkWNmgkAZFxbTaqj:matrix.org",
        "name": "Raspberry Pi | 🥧",
        "topic": "All things Raspberry Pi! | raspberrypi.com | reddit.com/r/raspberry_pi | rpilocator.com",
        "num_joined_members": 27133,
        "world_readable": 1,
        "guest_can_join": 1,
        "avatar_url": "mxc://matrix.org/SkzOOEArWtZXhTHeipMVJpcX",
        "canonical_alias": "#raspberrypi:matrix.org",
        "aliases": ""
    },
    {
        "id": 2778,
        "server": "matrix-federation.matrix.org",
        "room_id": "!SbrCGdmpyseSmOmdzV:hackliberty.org",
        "name": "Hack Liberty Community",
        "topic": "We are a group of cypherpunks, privacy advocates, engineers, and philosophers dedicated to the pursuit of truth, liberty, and knowledge for all. We believe technology is a tool for liberation, not enslavement. We fight tyranny with encryption, decentralization, and anonymity. | Space #hackliberty.org:hackliberty.org | Code of Conduct: https://git.hackliberty.org/hackliberty.org/hackliberty.org-legal/src/branch/main/code-of-conduct.md |  \nResources: https://git.hackliberty.org/hackliberty.org/Hack-Liberty-Resources | Uptime: https://status.hackliberty.org/status/hackliberty | \n\nKeywords: activism, agorism, anarchism, anarchist, ancient philosophy, anonymity, bitcoin, blockchain technology, censorship-resistant communication, crypto anarchy, crypto currency, cypherpunks, decentralization, deep web, digital privacy, encryption software, end-to-end encryption, freedom, hackers, hacking, identity protection, individualism, internet privacy, internet security, i2p, libertarian, libertarianism, liberty, minarchist, monero, natural law, netsec, online censorship, online security, open source software, p2p networks, password managers, privacy, privacy advocates, private browsing, qubes, secure chat, secure cloud storage, secure communication, secure email, secure file sharing, secure messaging, secure web browsing, security, tor, tyranny, virtual private networks (vpns), voluntarism, web anonymity, whistleblowing, xmr",
        "num_joined_members": 26163,
        "world_readable": 0,
        "guest_can_join": 0,
        "avatar_url": "mxc://hackliberty.org/FGvMBeabAAbHFhOrLMLIWJDT",
        "canonical_alias": "#community:hackliberty.org",
        "aliases": ""
    },
    {
        "id": 6,
        "server": "matrix-federation.matrix.org",
        "room_id": "!gWiVYCURkxIapWZaGy:ipfs.io",
        "name": "ipfs",
        "topic": "Join the IPFS Space at #ipfs-space:ipfs.io 🚀 |This room is bridged to https://discord.gg/Z4H6tdECb9 and https://filecoin.io/slack #ipfs",
        "num_joined_members": 26017,
        "world_readable": 1,
        "guest_can_join": 1,
        "avatar_url": "mxc://ipfs.io/3b30e690afa12b4da473049c4c7cf9ce88fc73e8",
        "canonical_alias": "#ipfs-chatter:ipfs.io",
        "aliases": ""
    },
    {
        "id": 2816,
        "server": "matrix-federation.matrix.org",
        "room_id": "!iXydryRqZVCnKoAhmh:hackliberty.org",
        "name": "Anonymity Privacy and Security",
        "topic": "This is where we discuss ways to protect your online identity and maintain privacy. Share experiences, learn strategies, and explore latest developments in online security. Join us and let's work towards a more private online world!\n\nTopics: anonymity, anonymous browsing, bitcoin, btc, crypto, cryptocurrency, cyber security, data security, dark web, decentralized, deep web, digital, encryption, exploit, fingerprinting, hacktivism, hacker, hackers, hacking, i2p, internet privacy, malware, market, mining, monero, online privacy, opsec, osint, personal data protection, phishing, privacy, pseudonymity, qubes, ransomware, secure communication, security, signal, surveillance, tails, tor, tracking, vpn, vulnerability, whonix, xmr | Space: #hackliberty.org:hackliberty.org | Resources: https://git.hackliberty.org/hackliberty.org/Hack-Liberty-Resources",
        "num_joined_members": 25558,
        "world_readable": 0,
        "guest_can_join": 0,
        "avatar_url": "mxc://hackliberty.org/shzHvXkhQZjEGjPXSOmjGvFr",
        "canonical_alias": "#anon:hackliberty.org",
        "aliases": ""
    },
    {
        "id": 160,
        "server": "matrix-federation.matrix.org",
        "room_id": "!WlpUlJzzLErKQistwb:hackliberty.org",
        "name": "Hidden Knowledge",
        "topic": "This is a sanctuary for those seeking to unravel the extraordinary. Dive deep into the abyss of hidden knowledge and engage in thought-provoking conversations, explore alternative perspectives, and challenge the status quo as we explore the fringes of reality together. Step into the unknown and liberate your mind in this realm where truth is not just a concept but a way of life. | Space: #hackliberty.org:hackliberty.org | Library: https://forum.hackliberty.org/t/the-library-of-alexandria/44 | Topics: 9/11 truth, area 51, illuminati, illuminati conspiracy, jfk assassination, mandela effect, new world order, nwo, project blue book, roswell incident, tavistock institute, the bilderberg group, the bohemian grove, the georgia guidestones, the great reset, the illuminati, the mandela effect, the matrix, the moon landing hoax, the new world order, the philadelphia experiment, the pineal gland, the qanon movement, the rothsch1ld family, the simulation hypothesis, the trilateral commission, the vatican $ecret archives, ufo sightings and cover-up, underground tunnels, universe mysteries, urban legends, astral projection, astral realm, astral travel, aura reading, chakras, chemtrails, consciousness exploration, crop circles, cryptids, cryptobotany, crystal grids, crystal healing, demons, divination, dumbs, dream interpretation, energy healing, esp, extraterrestrial life, false flag events, free energy, fringe, geomancy, ghost hunting, government cover-up, government surveillance, haarp conspiracy, hollow earth, ley line mapping, ley lines, lizard people, lucid dreaming, lucid living, magick, mandela effect, metaphysics, milab, moon anomalies and cover-up, moon landing hoax, mythology, mystic arts, mystic symbols, natural remedies, near-death experience, new age spirituality, new world order agenda, numerology, numerology charts, occult, occultism, orgonite, paranormal, past lives, panopticon, planetary alignments, psychic abilities, psychic development, psychic mediums, quantum mechanics, redpill, reincarnation, remote viewing, reptilian shapeshifters, reptilians, rfid chips and tracking, sacred geometry, sacred plants, sacred sites, shadow government, shamanism, shape shifting, simulation theory, soul retrieval, spirit guides, supernatural beings, synchronicity, tarot readings, telekinesis, telepathy, theosophy, third eye, time travel, transhumanism, underground tunnels, universe mysteries, urban legends, weather manipulation, conspiracy theories, zombie apocalypse ",
        "num_joined_members": 25238,
        "world_readable": 0,
        "guest_can_join": 0,
        "avatar_url": "mxc://hackliberty.org/KjDZBMPwbfsyUfOmnUYXtCRQ",
        "canonical_alias": "#hidden-knowledge:hackliberty.org",
        "aliases": ""
    },
    {
        "id": 32,
        "server": "matrix-federation.matrix.org",
        "room_id": "!SLQulqwEQbBXcnBrCi:matrix.org",
        "name": "ComfyUI general",
        "topic": "The most powerful and modular diffusion model GUI, api and backend with a graph/nodes interface. https://www.comfy.org https://github.com/comfyanonymous/ComfyUI\nOther rooms: #comfyui_space:matrix.org",
        "num_joined_members": 24739,
        "world_readable": 0,
        "guest_can_join": 0,
        "avatar_url": "mxc://matrix.org/KjMzvqkKFYzmxvenULPbvLTe",
        "canonical_alias": "#comfyui:matrix.org",
        "aliases": ""
    },
    {
        "id": 7,
        "server": "matrix-federation.matrix.org",
        "room_id": "!AEQOsKuwoGVVoVwfDj:matrix.org",
        "name": "Edgeware Public Square",
        "topic": "Bridge from Telegram",
        "num_joined_members": 23849,
        "world_readable": 1,
        "guest_can_join": 1,
        "avatar_url": "mxc://matrix.org/gQsNrxcMDxMNgsDJQodJuaIV",
        "canonical_alias": "#Hey:matrix.org",
        "aliases": ""
    },
    {
        "id": 250,
        "server": "matrix-federation.matrix.org",
        "room_id": "!ulWFCauIIprFQFfUql:hackliberty.org",
        "name": "Cypherpunk Cryptopia",
        "topic": "Welcome to the Cypherpunk Cryptopia, where privacy, security, and freedom take center stage. Join us as we discuss cryptography, decentralization, and online anonymity, working towards reshaping the digital landscape for a better future. Together, let's push the boundaries of what is possible and create a world where privacy is a right and censorship-resistant systems pave the way for a more open society.\n\nTopics: activism, agorism, anarchism, anarchist, ancient philosophy, anonymity, bitcoin, blockchain technology, censorship-resistant communication, crypto anarchy, crypto currency, cypherpunks, decentralization, deep web, digital privacy, encryption software, end-to-end encryption, freedom, hackers, hacking, identity protection, individualism, internet privacy, internet security, i2p, libertarian, libertarianism, liberty, minarchist, monero, natural law, netsec, online censorship, online security, open source software, p2p networks, password managers, privacy, privacy advocates, private browsing, qubes, secure chat, secure cloud storage, secure communication, secure email, secure file sharing, secure messaging, secure web browsing, security, tor, tyranny, virtual private networks (vpns), voluntarism, web anonymity, whistleblowing, xmr, agorism, agorist, agorist philosophy, alternative currencies, anarchism, anarcho-capitalism, asset management, altcoins, alternative finance, bitcoin, blockchain development, btc, barter systems, circular economy, collaborative consumption, collectibles, community building, counter-economics, cryptography, crypto circular economies, crypto lending, crypto mining, crypto regulations, crypto trading, crypto wallets, cryptocurrency, cybersecurity, cypherpunks, decentralized, decentralized applications, decentralized exchange, decentralized finance, decentralized finance platforms, defi, digital assets, digital currencies, distributed ledger technology, economic freedom, energy efficiency, environmental sustainability, ethereum, ethical investing, free market, free markets, freedom, gift economies, gold and silver coins, gold standard, green energy, homesteading, ico, individual liberty, individual sovereignty, initial exchange offerings, libertarian philosophy, liquidity pools, local currencies, monetary policy, mutual aid, nfts, non-aggression principle, numismatics, off-grid living, parallel institutions, peaceful parenting, peer-to-peer networks, peer-to-peer payments, precious metal investing, precious metals, privacy coins, proof-of-work, proof-of-stake, p2p, renewable energy sources, rare coins, second realm, self-sufficiency, security tokens, shared ownership, silver bullion, socially responsible investments, stable coins, smart contracts, survivalism, sustainable business models, sustainable finance, tokenization, voluntaryism, yield farming, xmr\n, Crypto, Bitcoin, Monero, XMR, BTC, Agorism, Crypto Anarchy, Cypherpunks, Tor, I2P, Deep Web, Dark Web, Ancap, Anarchy, Anarchist, Libertarian,  Libertarianism, Liberty, Freedom, Activisim, Privacy, Security, Tyranny, Conspiracy, Individualism, Minarchist, Free, Decentralization, Hackers, Hacking, Netsec, Anonymity,  Voluntarist, Natural Law | Space: #hackliberty.org:hackliberty.org | Resources: https://git.hackliberty.org/hackliberty.org/Hack-Liberty-Resources",
        "num_joined_members": 23739,
        "world_readable": 0,
        "guest_can_join": 0,
        "avatar_url": "mxc://hackliberty.org/TyTWUbjrHuepBlIicFqRtGaq",
        "canonical_alias": "#cypherpunks:hackliberty.org",
        "aliases": ""
    },
    {
        "id": 254,
        "server": "matrix-federation.matrix.org",
        "room_id": "!qdVPCgRTDxlJNyWKSa:hackliberty.org",
        "name": "Artificial Intelligence (AI)",
        "topic": "Public Bots: NO TOKENS -> ChatGPT-3.5-Turbo (!q prefix) | \nUnleash your imagination in the AI room, where artificial intelligence and boundless creativity converge. Collaborate on exciting projects, explore cutting-edge technologies, and shape the future of technology alongside like-minded AI enthusiasts. \n\n | Topics: ai, ai chatbot, ai development, ai learning, ai programming, ai robotics, ai technology, artificial intelligence, artificial intelligence companies, artificial intelligence course, artificial intelligence examples, artificial intelligence in business, artificial intelligence in healthcare, artificial intelligence news, artificial intelligence online course, artificial intelligence tutorial, automation, big data, big data analytics, chatbot, chatgpt, cognitive computing, computer vision, convolutional neural networks, DALL-E, data analytics, data mining, data science, deep learning, expert systems, facial recognition, generative adversarial networks, image recognition, intelligent agents, internet of things, iot, jailbreak, jailbreaking, knowledge representation, machine learning, midjourney, natural language processing, neural networks, object detection, openai, pattern recognition, predictive analytics, python for ai, quantum computing, reinforcement learning, robotics, stable diffusion, speech recognition, supervised learning, support vector machines, transfer learning, unsupervised learning, voice assistants, voice recognition, web scraping, AI, Artificial Intelligence, Robots, Automation, ChatGPT, OpenAI, Stable Diffusion, Midjourney, DALL-E, AI, artificial intelligence, machine learning, deep learning, neural networks, natural language processing, computer vision, data science, big data, predictive analytics, chatbots, robotics, automation, cognitive computing, intelligent agents, knowledge representation, pattern recognition, speech recognition, image recognition, jailbreak, jail break, jailbreaking | ChatGPT Jail Break: https://paste.hackliberty.org/?c2f5af4571abd8df#6jkJGjyXzKbBw9SbXC8b4oaZEeSWR2EMHCgFFLoxZrmF | Space: #hackliberty.org:hackliberty.org | Resources: https://git.hackliberty.org/hackliberty.org/Hack-Liberty-Resources ",
        "num_joined_members": 23695,
        "world_readable": 0,
        "guest_can_join": 0,
        "avatar_url": "mxc://hackliberty.org/FdeVxgjSrnmiIkfcgKpjFMPZ",
        "canonical_alias": "#ai:hackliberty.org",
        "aliases": ""
    },
    {
        "id": 89,
        "server": "matrix-federation.matrix.org",
        "room_id": "!OuWSIScDCZYsxVNVAk:matrix.org",
        "name": "ComfyUI dev",
        "topic": null,
        "num_joined_members": 20602,
        "world_readable": 1,
        "guest_can_join": 0,
        "avatar_url": "mxc://matrix.org/xfEgGAdqzcEAMdJLpcjlUAWQ",
        "canonical_alias": "#comfyui_dev:matrix.org",
        "aliases": ""
    },
    {
        "id": 2680,
        "server": "matrix-federation.matrix.org",
        "room_id": "!iuyQXswfjgxQMZGrfQ:matrix.org",
        "name": "Python",
        "topic": "Everything Python | Our Rooms: #python-community:matrix.org | Code of Conduct: bit.ly/pycoc | Beginner?: wiki.python.org/moin/BeginnersGuide",
        "num_joined_members": 19585,
        "world_readable": 1,
        "guest_can_join": 0,
        "avatar_url": "mxc://michaelsasser.org/rVoVagfSSyuvSJfDElNrhNvb",
        "canonical_alias": "#python:matrix.org",
        "aliases": ""
    },
    {
        "id": 8,
        "server": "matrix-federation.matrix.org",
        "room_id": "!ZVBGnTSVYUGWMArNVx:matrix.org",
        "name": "Filecoin Lotus Implementation",
        "topic": "This is a read-only mirror from the Filecoin Slack Community. To participate, please go to https://filecoin.io/slack",
        "num_joined_members": 19333,
        "world_readable": 0,
        "guest_can_join": 0,
        "avatar_url": "mxc://matrix.org/tHexWNYIekjBrkCCnEbZtPaF",
        "canonical_alias": "#fil-lotus:matrix.org",
        "aliases": ""
    }
]